# Задание 5. Уровень - математик.
# Условие: всегда интересно , является ли число простым. Простые числа - натуральные числа,
# которые имеют только 2 делителя : 1 и само это число (т.к. они обязаны отличаться - 1 это не простое число).
# Ваша задача вывести все делители числа N. В случае, если число N - простое, нужно дополнительно сообщить об этом.

# Входные данные: N - натуральное число (< 1000000).
# Выходные данные: все делители числа N в порядке возрастания. Если число N - простое, то еще вывести слово ACHTUNG

# Пример:
# Ввод:                                               # Вывод:
# 5                                                   1 5
#                                                     ACHTUNG

# 9                                                   1 3 9 


# 13                                                  1 13
#                                                     ACHTUNG


n=int(input())
i=1
a=[] 
while i<=n**0.5:
    if n%i==0: 
        a.append(i)
        if i!=n//i: a.append(n//i) 
    i+=1
a.sort() 
for x in a: print(x, end=" ") 
print(end='\n')
if len(a)==2: print("ACHTUNG")