#Задача 5: Уровень - решатель.
"""
Условие: На вход вашей программе в стандартном вводе даны действительные коэффициенты A, B и C уравнения Ax² + Bx + C = 0. 
Выведите все его различные действительные корни в любом порядке. 
Гарантируется, что хотя бы один из коэффициентов не равен нулю.
"""


# Рекомендация : делайте все в одном потоке при помощи ветвлений if elif else.

# На проверке у меня 30 тестов. Если валится хотя бы на одном - задача не засчитана.
# Пока тесты без времени. Но это пока).


# Открытые тесты:
#input:         output:
#2 5 2		X1:-0.5 X2:-2
#2 4 2		X1:-1
#2 1 2	
#0 4 10		X1:-2.5

a,b,c=map(int, input().split())
if a!=0 and b!=0:
    D=b**2-4*a*c
    if D>0:
        x1=(-1*b+D**0.5)/(2*a)
        x2=(-1*b-D**0.5)/(2*a)
        if x1>x2: print("X1:","{:.2f}".format(x1),"\nX2:","{:.2f}".format(x2), sep='')
        else: print("X1:","{:.2f}".format(x2),"\nX2:","{:.2f}".format(x1), sep='')
    elif D==0:
        x1=(-1*b)/(2*a)
        #print("X1:",x1, sep="")
        print("X1:","{:.2f}".format(x1), sep='')
    else:
        print("")
elif a==0 and b!=0:
    x1=(-1*c)/b
    print("X1:","{:.2f}".format(x1),sep='')
elif a==0 and b==0:
    print("")
