# Задача 4. Уровень - математик.

# Условие: На вход поступает число N (>= 0, целое).
# Требуется вывести первые N элементов последовательности Фибоначи через запятую

# Пример:
# Ввод:                                                        Вывод:
# 3                                                            0, 1, 1

# 5                                                            0, 1, 1, 2, 3

# 7                                                           0, 1, 1, 2, 3, 5, 8


n=int(input())
a=[]
a.append(0)
a.append(1)
i=2
n1=n
while n-2>0:
    b=a[i-2]+a[i-1]
    a.append(b)
    n-=1
    i+=1
for x in range(n1-1): print(a[x],", " sep="",end=" ") 
print(a[-1])
